/* 
  Alerts.strings
  CleanMyMac

  Created by Vera Tkachenko on 2/22/15.
  Copyright (c) 2015 MacPaw. All rights reserved.
*/
/* Buttons */

"AlertButton_Continue" = "Kontynuuj";
"AlertButton_BuyLicense" = "Zakup licencji";
"AlertButton_BuyLicenseWithDiscount" = "Kup z rabatem %li%%";
"AlertButtonTitle_Erase" = "Usuń";

/* App Termination */
"AlertButton_ContinueScan" = "Kontynuuj skanowanie";
"AlertButton_ContinueClean" = "Kontynuuj oczyszczanie";
"AlertButton_QuitCompleteTasks" = "Wykonać wszystko i zamknąć";
"AlertButton_QuitForce" = "Wymuś zakończenie";
"AlertButton_CheckForBeta" = "Sprawdź aktualizacje Beta";
"Stop" = "Zatrzymaj";

"AlertButtonTitle_Uninstall" = "Odinstaluj";
"AlertButtonTitle_DontUninstall" = "Nie odinstalowywuj";

"AlertButtonTitle_Reset" = "Wyzeruj";

/* Running not from Apps folder */
"AlertButtonTitle_Install" = "Zainstaluj";
"AlertButtonTitle_DontInstall" = "Nie instaluj";
"AlertButtonTitle_Overwrite" = "Zastąp";
"AlertButtonTitle_DontOverWrite" = "Nie zastępuj ";


/* Beta Updates Alert */
"AlertDescription_BetaUpdateEnabling" = "Wersje Beta dają dostęp do niektórych funkcji i możliwości przed ich oficjalnym wydaniem publicznym. Należy pamiętać, że wersje Beta mogą również być niestabilne i doprowadzić do utraty danych. Korzystasz z nich na własne ryzyko. MacPaw nie udziela pomocy technicznej dla wersji Beta i nie jest odpowiedzialna za wszelkie szkody spowodowane przez te wersje. Użytkownicy wersji Beta mogą pomóc w rozwoju oprogramowania za pomocą pozycji 'Wyraź swoją opinię...' w menu 'Pomoc'.";

"AlertTitle_BetaUpdateEnabling" = "Czy na pewno chcesz instalować wersje CleanMyMac Beta?";

/* Reset Ignore List Alert */
"AlertDescription_ResetIgnoreList" = "To pozwoli CleanMyMac zeskanować i usunąć rzeczy, które z jakiegokolwiek powodu zostały wcześniej dodane do listy ignorowania.";

"AlertTitle_ResetIgnoreList" = "Czy na pewno chcesz przywrócić domyślną listę ignorowania?";

/* Activation */
"AlertTitle_CleaningWithinLimitAlert" = "Twoja kopia CleanMyMac nie jest zarejestrowana.";

"AlertDescription_CleaningWithinLimitAlert" = "Zostało Ci %@ do usunięcia w tej wersji demo CleanMyMac. Uaktywniona kopia nie ma ograniczeń i pozwala w pełni wykorzystać wszystkie zalety bycia zarejestrowanym użytkownikiem CleanMyMac 2.";

/* Uninstalling CMM */
"AlertDescription_UninstallingCMM" = "CleanMyMac to aplikacja, z którą właśnie pracujesz. Jeśli klikniesz przycisk Odinstaluj, będzie ona zakończona i całkowicie usunięta. Czy chcesz odinstalować CleanMyMac?";

"AlertTitle_UninstallingCMM" = "Odinstalowuję CleanMyMac";

/* Reseting CMM */
"AlertDescription_ResetCMM" = "Otwórz program ponownie aby kontynuować pracę.";
"AlertTitle_ResetCMM" = "Właśnie zresetowałeś ustawienia CleanMyMac i dla poprawnego działania program musy zostać otwarty ponownie.";
"AlertButton_ConfirmSelfRestart" = "Otwórz ponownie";
"AlertButton_CancelSelfRestart" = "Anuluj";

/* Uninstalling Setapp */

"AlertTitle_UninstallingSetappMessage" = "Wybrałeś pełną dezinstalację Setapp i %li programów. Na pewno chcesz usunąć Setapp razem z programami pokrewnymi?";
"AlertDescription_UninstallingSetappMessage" = "Należy pamiętać, że bez głównego programu Setapp nie będzie dostępna usługa, dostarczająca coraz większy zbiór programów.";
"AlertButton_SelectSetappApplications" = "Zaznacz programy Setapp";
"AlertCheckboxText_UninstallingSetappMessage" = "Nie pokazuj tego komunikatu ponownie";

/* Drop iPhoto alert */
"AlertDescription_DropiPhotoWhileScanning" = "Rozpoczęcie nowego skanowania spowoduje utracenie bieżących wyników.";

"AlertTitle_DropiPhotoWhileScanning" = "Zeskanuj inną bibliotekę.";

/* Logging mode alert */
"AlertTitle_LoggingMode" = "Włączam tryb rozszerzonego logowania.";

"AlertDescription_LoggingMode" = "CleanMyMac zapisze rozszerzony dziennik wszystkich znalezionych rzeczy. Gdy funkcja rozszerzonego raportowania jest włączona, nasz zespół pomocy technicznej będzie w stanie szybciej pomóc Ci w rozwiązaniu wszelkich ewentualnych problemów.";

/* Need To Close Applications Alert */
"AlertDescription_GenericAuth" = "CleanMyMac potrzebuje Twojego zezwolenia na dokonanie zmian, wymaganych przez jego funkcjonalność.";

/* Extensions Authorize Alert */
"AlertDescription_ExtensionsAuthFormat" = "CleanMyMac wymaga autoryzacji dla %@ tego rozszerzenia i wykonania innych zadań, które wymagają uprawnień administratora.";

"ExtensionsAuthAlert_EnableAction" = "włącz";

"ExtensionsAuthAlert_DisableAction" = "wyłącz";

/* CMM force quit alert */
"AlertTitle_ForceQuit" = "CleanMyMac nie potrafił normalnie zakończyć pracę przy ostatniej próbie jego zakończenia.";

"AlertDescription_ForceQuit" = "Niektóre procesy związane z oczyszczaniem nadal działają i mogą spowodować utratę danych lub nieoczekiwane zachowanie się systemu, jeżeli zostaną przerwane. Zalecamy zakończyć program dopiero po zakończeniu wszystkich procesów.";

/* CMM running not from Apps folder alerts */
"AlertMessageText_RunningNotFromAppFolder" = "CleanMyMac został uruchomiony nie z zalecanego folderu Programów.";

"AlertInformativeText_WishInstallQuestion" = "Czy chcesz zainstalować CleanMyMac do folderu Programów przed zakończeniem?";

"AlertTitle_AlreadyInstalled" = "CleanMyMac już jest zainstalowany!";

"AlertTitle_OverwriteQuestion" = "Czy chcesz zastąpić CleanMyMac w folderze Programów?";

"AlertTitle_InstallationFailder" = "Instalacja CleanMyMac nie powiodła się!";

"AlertTitle_CopyToApplicationFolderSuggestion" = "Spróbuj skopiować program do żądanej lokalizacji ręcznie. Zalecamy kopijowanie do folderu Programy.";

/* Selection Alert LargeOldFiles */
"SelectionCautionAlertTitle_LargeOld" = "Zaznaczyłeś kilka plików osobistych do usunięcia.";

"SelectionCautionAlertMessage_LargeOld" = "Należy pamiętać, że moduł Dużych i starych plików nie sugeruje, że rzeczy mogą być usunięte bezpiecznie. Proszę używać go jako odniesienie i być ostrożnym przy podejmowaniu decyzji o usunięciu plików.";

/* Selection Alert Uninstaller */
"SelectionCautionAlertTitle_Uninstaller" = "Zaznaczyłeś kilka programów do dezinstalacji.";

"SelectionCautionAlertMessage_Uninstaller" = "Należy pamiętać, że moduł dezinstalatora ma na celu całkowicie usunięcie programów. Programy znikną z systemu po kliknięciu przycisku \"Odinstaluj\".";

/* Remove Alerts LargeOldFiles */
"RemoveAlertMessageText_LargeOld1File" = "Czy na pewno chcesz usunąć „%@” na stałe?";

"RemoveAlertMessageText_LargeOldXFiles" = "Czy na pewno chcesz usunąć %@ na stałe?";

"RemoveAlertInformativeText_LargeOldFilesGroupScanner" = "Tej czynności nie można cofnąć.";

/* Remove Alerts Uninstaller */
"RemoveAlertMessageText_Uninstaller1App" = "Czy na pewno chcesz usunąć „%@” i wszystkie powiązane rzeczy?";

"RemoveAlertMessageText_UninstallerXApps" = "Czy na pewno chcesz usunąć %@ i wszystkie powiązane rzeczy?";

"RemoveAlertMessageText_Uninstaller1File" = "Czy na pewno chcesz usunąć „%@” na stałe?";

"RemoveAlertMessageText_UninstallerRelatedFiles" = "Czy na pewno chcesz usunąć %@ na stałe?";

"RemoveAlertMessageText_UninstallerResetApp" = "Czy na pewno chcesz usunąć wszystkie powiązane rzeczy i wyzerować „%@” ?";

"RemoveAlertMessageText_UninstallerSelectedItems" = "Czy na pewno chcesz usunąć zaznaczone rzeczy na stałe?";

"RemoveAlertInformativeText_Uninstaller" = "Tej czynności nie można cofnąć.";

/* Remove Alerts Extensions */
"RemoveAlertMessageText_Extensions1Item" = "Czy na pewno chcesz usunąć „%@” na stałe?";

"RemoveAlertMessageText_ExtensionsXItems" = "Czy na pewno chcesz usunąć %@ na stałe?";

"RemoveAlertInformativeText_ExtensionsGroupScanner" = "Tej czynności nie można cofnąć.";

/* Remove Alerts Eraser */
"RemoveAlertMessageText_Eraser1Item" = "Czy na pewno chcesz wymazać „%@” na stałe?";

"RemoveAlertMessageText_EraserXItems" = "Czy na pewno chcesz wymazać %@ na stałe?";

"RemoveAlertInformativeText_EraserGroupScanner" = "Tej czynności nie można cofnąć.";

/* Ignored Items alerts */
"AlertTitle_1_IgnoredItemsDidAdd" = "Dodałeś jedną rzecz do Listy ignorowania.";

"AlertTitle_N_IgnoredItemsDidAddFormat" = "Dodałeś %@ do listy ignorowania.";

"AlertDescription_1_IgnoredItemsDidAdd" = "Rzecz będzie ukryta z wyników skanowania. Możesz zarządzać ignorowanymi rzeczami w Preferencjach.";

"AlertDescription_N_IgnoredItemsDidAdd" = "Rzeczy będą ukryte z wyników skanowania. Możesz zarządzać ignorowanymi rzeczami w Preferencjach.";

"AlertTitle_ShouldSelectIgnoredItem" = "Czy na pewno chcesz zaznaczyć do usunięcia ignorowaną rzecz?";

"AlertDescription_ShouldSelectIgnoredItem" = "Usuwanie takich rzeczy może wpłynąć na funkcjonalność systemu lub programów z nimi związanych.";

/* No comment provided by engineer. */
"AlertTitle_StopCleanWarning" = "Czy chcesz zatrzymać proces oczyszczania zanim się skończy?";

/* No comment provided by engineer. */
"AlertTitle_StopScanWarning" = "Czy chcesz zatrzymać proces skanowania zanim się skończy?";

/* No comment provided by engineer. */
"AlertDecription_StopCleanWarning" = "Przerywanie oczyszczania pozostawi pewną ilość niepotrzebnych rzeczy na Twoim Macu.";

/* No comment provided by engineer. */
"AlertTitle_StartOver" = "Czy chcesz odrzucić wyniki skanowania i zacząć od nowa?";

/* No comment provided by engineer. */
"AlertDecription_StartOver" = "Będzie wymagane nowe skanowanie, gdyż bieżące wyniki nie będą zapisane.";

/* No comment provided by engineer. */
"AlertTitle_Rescan" = "Czy chcesz zacząć od nowa i odrzucić wyniki skanowania?";

/* No comment provided by engineer. */
"AlertDescription_Rescan" = "Aktualne wyniki skanowania i lista zaznaczonych rzeczy nie zostaną zapisane.";

/* No comment provided by engineer. */
"AlertTitle_Refresh" = "Czy chcesz odświeżyć wyniki w module „%@”?";

/* No comment provided by engineer. */
"AlertDescription_Refresh" = "Lista zaznaczonych rzeczy nie zostanie zapisana.";

/* No comment provided by engineer. */
"AlertDescription_StopScanWarning" = "Przerwane skanowane wykaże niepełne wyniki.";

/* No comment provided by engineer. */
"AlertTitle_UnableToEnablePlugin" = "Nie udało się włączyć/wyłączyć wtyczkę.";

/* No comment provided by engineer. */
"AlertDescription_UnknownError" = "Wystąpił nieznany błąd. Skontaktuj się ze Wsparciem klienta.";

/* Maintenance verify disk */
"AlertTitle_VerifySystemDiskWarn" = "Podczas sprawdzania dysku komputer może przestać odpowiadać.";
"AlertDescription_VerifySystemDiskWarn" = "Ze względu na dużą aktywność podczas sprawdzania, system może przestać odpowiadać na kilka minut. Proszę traktować to jako normalne zachowanie się.";

/* Alerts */
"AlertDescription_QuitOnScan" = "Zakończenie programu przerwie skanowanie i spowoduje utratę wszystkich wyników.";

/* Alerts */
"AlertDescription_QuitOnClean" = "Zakończenie programu przerwie proces oczyszczania i wykaże niepełne wyniki.";

/* Alerts */
"AlertTitle_QuitOnScan" = "Czy chcesz zamknąć CleanMyMac zanim skończy się bieżące skanowanie?";

/* Alerts */
"AlertTitle_QuitOnClean" = "Czy chcesz zamknąć CleanMyMac zanim czyszczenie się skończy?";

/* System Restart */
"CleanMyMac has just uninstalled %@ malware. A restart of your Mac is required to finish the process." = "CleanMyMac 2 właśnie odinstalował malware %@. Prosimy uruchomić komputer ponownie dla zakończenia procesu.";
"Please note that some applications may work incorrectly until your system is restarted." = "Niektóre programy mogą działać nieprawidłowo dopóki system nie zostanie uruchomiony ponownie.";


/* Self Uninstall Discount */
"SelfUninstallDiscount_AlertTitle" = "Czasami możemy zrobić wyjątek.";
"SelfUninstallDiscount_AlertDescription" = "I to jest jedna z takich okazji. Tylko dzisiaj jesteśmy szczęśliwi zaoferować Ci rabat %li%% na pełną wersję CleanMyMac 3.";

/* Self uninstall alert */
"SelfUninstall_AlertDescription" = "Pomóż nam udoskonalić CleanMyMac i powiedz nam, dlaczego chcesz go odinstalować:";
"SelfUninstall_AlertTitle" = "Jest nam przykro, że opuszczasz nas!";
"Submit and Uninstall" = "Wyślij i odinstaluj";

"The price is a bit too much." = "Zbyt wysoka cena.";
"It's too hard to use. I had trouble figuring it out." = "Zbyt trudny w zrozumieniu i użyciu.";
"It didn't find enough to clean!" = "Znalazł za mało śmieci!";
"It doesn't seem safe to use." = "Nie wydaje się bezpiecznym w użyciu.";
"Other:" = "Inne:";

"IgnoreList_AlertTitle_AddedMacTrashToIgnoreList" = "Czy na pewno chcesz dodać kosz z Twójego dysku startowego do Listy ignorowania?";

"IgnoreList_AlertDescription_AddedMacTrashToIgnoreList" = "Ta czynność wyłączy funkcję monitotowania kosza. CleanMyMac 3 nie będzie powiadamiał o wypełnionym koszu.";

"IgnoreList_AlertTitle_EnableTrashMonitor" = "Czy na pewno chcesz włączyć funkcję monitorowania kosza?";

"IgnoreList_AlertDescription_EnableTrashMonitor" = "Ta czynność usunie Twój dysk startowy z Listy ignorowania.";

"AlertTitle_VerifySystemDiskWarn" = "Podczas sprawdzania dysku komputer może przestać odpowiadać.";

"AlertDescription_VerifySystemDiskWarn" = "Ze względu na dużą aktywność podczas sprawdzania, system może przestać odpowiadać na kilka minut. Proszę traktować to jako normalne zachowanie się.";

"UnsupportedOSAlert_Message" = "Ta kopia CleanMyMac nie jest zgodna z macOS %@ i przyszłymi wersjami.";

"UnsupportedOSAlert_Informative" = "Uaktualnij CleanMyMac do najnowszej wersji, w pełni zgodnej z Twoją wersją macOS.";

/* Erase System Files Alert */
"EraseSystemFilesAlert_MessageText" = "Niektóre z wybranych rzeczy nie mogą być dodane do Niszczarki.";

"EraseSystemFilesAlert_InformativeText" = "Usunięcie tych plików lub folderów może uszkodzić system.";

"IgnoreList_AlertTitle_AddedMacTrashToIgnoreList" = "Czy na pewno chcesz dodać kosz z Twójego dysku startowego do Listy ignorowania?";
"IgnoreList_AlertDescription_AddedMacTrashToIgnoreList" = "Ta czynność wyłączy funkcję monitotowania kosza. CleanMyMac 3 nie będzie powiadamiał o wypełnionym koszu.";

"IgnoreList_AlertTitle_EnableTrashMonitor" = "Czy na pewno chcesz włączyć funkcję monitorowania kosza?";
"IgnoreList_AlertDescription_EnableTrashMonitor" = "Ta czynność usunie Twój dysk startowy z Listy ignorowania.";

/* Self Uninstall Discount */
"SelfUninstallDiscount_Uninstall" = "Odinstaluj";
"SelfUninstallDiscount_Purchase" = "Kup z rabatem %li%%";

/* Buttons */
"Quit" = "Zakończ";

"Verify System Disk" = "Sprawdź dysk systemowy";
"Download" = "Pobierz";

"Submit" = "Wyślij";

"Restart" = "Uruchom ponownie";

/* Alert button */
"Cancel" = "Anuluj";
"OK" = "OK";
"Remove" = "Usuń";

"Start New Scan" = "Nowe skanowanie";

/* Drop Trashes alert */
"AlertTitle_DropWhileScanning_TrashesGroupScanner" = "Zeskanuj inną bibliotekę.";
"AlertDescription_DropWhileScanning_TrashesGroupScanner" = "Rozpoczęcie nowego skanowania spowoduje utracenie bieżących wyników.";

/* Drop LAOF alert */
"AlertTitle_DropWhileScanning_LargeOldFilesGroupScanner" = "Skanuj inny folder.";
"AlertDescription_DropWhileScanning_LargeOldFilesGroupScanner" = "Rozpoczęcie nowego skanowania spowoduje utracenie bieżących wyników.";
"AlertTitle_MoveToAlbumInPhotos_LargeOldFilesGroupScanner" = "Duże i stare rzeczy z mediateki Zdjęć zostaną zebrane w albumie „Pliki do usunięcia”.";
"AlertDescription_MoveToAlbumInPhotos_LargeOldFilesGroupScanner" = "Nie zapomnij usunąć te pliki w aplikacji Zdjęcia, żeby zaoszczędzić miejsce.";

/* Drop iPhoto alert */
"AlertDescription_DropWhileScanning_iPhotoGroupScanner" = "Rozpoczęcie nowego skanowania spowoduje utracenie bieżących wyników.";
"AlertTitle_DropWhileScanning_iPhotoGroupScanner" = "Zeskanuj inną bibliotekę.";

/* Unsupported Photos Library version */
"AlertTitle_PhotoLibraryUnsupportedOld" = "Skanowana biblioteka nie jest obsługiwana przez CleanMyMac 3.";
"AlertDescription_PhotoLibraryUnsupportedOld" = "Prosimy uaktualnić bibliotekę zdjęć do najnowszej wersji.";
"AlertTitle_PhotoLibraryUnsupportedNew" = "Skanowana biblioteka jeszcze nie jest obsługiwana przez CleanMyMac 3.";
"AlertDescription_PhotoLibraryUnsupportedNew" = "Obecnie sprawdzamy zgodność CleanMyMac 3 z tą wersją biblioteki. Spróbuj ponownie wkrótce.";

/* Activation - Deactivate License Alert */
"ActivationDeactivateLicense_MessageText" = "Na pewno chcesz dezaktywować licencję CleanMyMac 3 na tym Macu?";
"ActivationDeactivateLicense_InformativeText" = "To dezaktywuje tę kopię programu, ale umożliwi aktywację na innym komputerze.";
"Disable License" = "Dezaktywuj licencję";

/* Move to Setapp alert */
"AlertMoveToSetapp_Message" = "Wygląda na to, że masz Setapp na Twoim Macu. Czy chcesz przejść do wersji CleanMyMac z Setapp?";
"AlertMoveToSetapp_Informative" = "Jest taka sama i będziesz zawsze na bieżąco z najnowszymi uaktualnieniami.";
"AlertMoveToSetapp_Switch" = "Przejdź";
"AlertMoveToSetapp_DontSwitch" = "Nie, dziękuję";

/* switch to Setapp version of CMM*/
"AlertSwitchToSetappVersionOfCMM_Message" = "Masz również indywidualną wersję CleanMyMac.";
"AlertSwitchToSetappVersionOfCMM_InformationText" = "Czy chcesz przejść do wersji z Setapp i przenieść poprzednie ustawienia programu?";
"AlertSwitchToSetappVersionOfCMM_Switch" = "Przejdź";
"AlertSwitchToSetappVersionOfCMM_No_Thanks" = "Nie, dziękuję";
